Revit 2027 API
LinearArray.IsElementArrayable Method
 Indicates whether the input element is arrayable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsElementArrayable(
	Document aDoc,
	ElementId id
)
Public Shared Function IsElementArrayable (
	aDoc As Document,
	id As ElementId
) As Boolean
public:
static bool IsElementArrayable(
	Document^ aDoc,
	ElementId^ id
)
static member IsElementArrayable :
        aDoc : Document *
        id : ElementId -> bool
Parameters
aDoc Document
 The document.
id ElementId
 The element id.
Return Value
Boolean
 True if the input element is arrayable, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace